src/cf/Catalogs/PrintFormTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>PrintFormTemplates</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataSource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Template</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VisibilityCondition</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateForObjectExport</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectSaveFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ObjectsExportFormats</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPrintForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintFormDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Presentations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LanguageCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Template</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DataSources</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DataSource</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/PrintFormTemplates/Forms/TemplateSettings/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If ValueIsFilled(Parameters.LanguageCode) Then
		Items.DefaultPrintForm.Enabled = (Parameters.LanguageCode = Common.DefaultLanguageCode());
	EndIf;
	
	GroupVisibility = PrintManagement.IsIncludedInObjectsWithDefaultPrintForms(TypeOf(Parameters.LayoutOwner));
	Items.GroupDefaultPrintForm.Visible = GroupVisibility;
	
	If GroupVisibility Then
		RefTemplate = Catalogs.PrintFormTemplates.RefTemplate(Parameters.IdentifierOfTemplate);
		
		If ValueIsFilled(RefTemplate) Then
			AttributesNames = "Description,DefaultPrintForm,PrintFormDescription";
			TemplateData1 = Common.ObjectAttributesValues(RefTemplate, AttributesNames);
			
			TemplateDescr        = TemplateData1.Description;
			DefaultPrintForm     = TemplateData1.DefaultPrintForm;
			PrintFormDescription = TemplateData1.PrintFormDescription;
		Else
			TemplateDescr = Parameters.TemplateDescr;
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, Exit, WarningText, StandardProcessing)
	
	Notification = New CallbackDescription("OnConfirmClosing", ThisObject);
	CommonClient.ShowFormClosingConfirmation(Notification, Cancel, Exit,, WarningText);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	UpdateFormDisplay();
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure TemplateDescrOnChange(Item)
	UpdateFormDisplay();
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure OK(Command)
	SaveAndLoad();
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure OnConfirmClosing(Result = Undefined, AdditionalParameters = Undefined) Export
	SaveAndLoad();
EndProcedure

&AtClient
Procedure SaveAndLoad()
	
	ParametersStructure = New Structure;
	ParametersStructure.Insert("DocumentName", TemplateDescr);
	ParametersStructure.Insert("DefaultPrintForm", DefaultPrintForm);
	ParametersStructure.Insert("PrintFormDescription", PrintFormDescription);
	
	Close(ParametersStructure);
	
EndProcedure

&AtClient
Procedure UpdateFormDisplay()
	Items.PrintFormDescription.InputHint = TemplateDescr;
EndProcedure
#EndRegion
